pasta-auto/PASTA1.0/ecu-fw/r_Flash_API_RX600.h
#if defined(MCU_RX610) || defined(MCU_RX621) || defined(MCU_RX62N) || defined(MCU_RX62T)
    /* 'size' parameter for R_FlashDataAreaBlankCheck */
    #define BLANK_CHECK_8_BYTE       0	
#elif defined(MCU_RX630) || defined(MCU_RX631) || defined(MCU_RX63N)
    /* 'size' parameter for R_FlashDataAreaBlankCheck */
    #define BLANK_CHECK_2_BYTE       0
#endif
/* 'size' parameter for R_FlashDataAreaBlankCheck */
#define BLANK_CHECK_ENTIRE_BLOCK 1  

/******************************************************************************
Exported global functions (to be accessed by other files)
******************************************************************************/
uint8_t R_FlashErase(uint8_t block );
#if defined(MCU_RX630) || defined(MCU_RX631) || defined(MCU_RX63N)
uint8_t R_FlashEraseRange(uint32_t start_addr, uint32_t bytes);
#endif
uint8_t R_FlashWrite(uint32_t flash_addr, uint32_t buffer_addr, uint16_t bytes);
uint8_t R_FlashProgramLockBit(uint8_t block);
uint8_t R_FlashReadLockBit(uint8_t block);
uint8_t R_FlashSetLockBitProtection(uint8_t lock_bit);                       
uint8_t R_FlashGetStatus(void);                        
/* Data Flash Only Functions */
void R_FlashDataAreaAccess(uint16_t read_en_mask, uint16_t write_en_mask);
uint8_t R_FlashDataAreaBlankCheck(uint32_t address, uint8_t size);

/* These functions are only used when BGO (non-blocking) mode is enabled */
#if defined(DATA_FLASH_BGO) || defined(ROM_BGO)
/* Callback function to call when flash erase is finished */
void FlashEraseDone(void);
/* Callback function to call when flash write is finished */
void FlashWriteDone(void);
/* Function to take care of flash errors */
void FlashError(void);
/* Callback function to call when flash blank check is finished. 'result' 
   argument is 0 if block was blank and 1 if it was not */ 
void FlashBlankCheckDone(uint8_t result);
#endif

#ifdef COPY_CODE_BY_API
void R_FlashCodeCopy(void);
#endif

/* Memory specifics for the RX610 group */
#if defined(MCU_RX610)

    /* User ROM Block Area           Size: Start Addr -   End Addr */
    #define BLOCK_0     0		/*    8KB: 0xFFFFE000 - 0xFFFFFFFF */
    #define BLOCK_1     1		/*    8KB: 0xFFFFC000 - 0xFFFFDFFF */
    #define BLOCK_2     2		/*    8KB: 0xFFFFA000 - 0xFFFFBFFF */
    #define BLOCK_3     3		/*    8KB: 0xFFFF8000 - 0xFFFF9FFF */
    #define BLOCK_4     4		/*    8KB: 0xFFFF6000 - 0xFFFF7FFF */
    #define BLOCK_5     5		/*    8KB: 0xFFFF4000 - 0xFFFF5FFF */
    #define BLOCK_6     6		/*    8KB: 0xFFFF2000 - 0xFFFF3FFF */
    #define BLOCK_7     7		/*    8KB: 0xFFFF0000 - 0xFFFF1FFF */
    #define BLOCK_8     8		/*   64KB: 0xFFFE0000 - 0xFFFEFFFF */
    #define BLOCK_9     9		/*   64KB: 0xFFFD0000 - 0xFFFDFFFF */
    #define BLOCK_10    10		/*   64KB: 0xFFFC0000 - 0xFFFCFFFF */
    #define BLOCK_11    11		/*   64KB: 0xFFFB0000 - 0xFFFBFFFF */
    #define BLOCK_12    12		/*   64KB: 0xFFFA0000 - 0xFFFAFFFF */
    #define BLOCK_13    13		/*   64KB: 0xFFF90000 - 0xFFF9FFFF */
    #define BLOCK_14    14		/*   64KB: 0xFFF80000 - 0xFFF8FFFF */
    #define BLOCK_15    15		/*   64KB: 0xFFF70000 - 0xFFF7FFFF */
    #define BLOCK_16    16		/*   64KB: 0xFFF60000 - 0xFFF6FFFF */
    #define BLOCK_17    17		/*  128KB: 0xFFF40000 - 0xFFF5FFFF */
    #define BLOCK_18    18		/*  128KB: 0xFFF20000 - 0xFFF3FFFF */
    #define BLOCK_19    19		/*  128KB: 0xFFF00000 - 0xFFF1FFFF */
    #define BLOCK_20    20      /*  128KB: 0xFFEE0000 - 0xFFEFFFFF */
    #define BLOCK_21    21      /*  128KB: 0xFFEC0000 - 0xFFEDFFFF */
    #define BLOCK_22    22      /*  128KB: 0xFFEA0000 - 0xFFEBFFFF */
    #define BLOCK_23    23      /*  128KB: 0xFFE80000 - 0xFFE9FFFF */
    #define BLOCK_24    24      /*  128KB: 0xFFE60000 - 0xFFE7FFFF */
    #define BLOCK_25    25      /*  128KB: 0xFFE40000 - 0xFFE5FFFF */
    #define BLOCK_26    26      /*  128KB: 0xFFE20000 - 0xFFE3FFFF */
    #define BLOCK_27    27      /*  128KB: 0xFFE00000 - 0xFFE1FFFF */

    /* Data Flash Block Area         Size: Start Addr -   End Addr */
    #define BLOCK_DB0   28	    /*    8KB: 0x00100000 - 0x00101FFF */
    #define BLOCK_DB1   29	    /*    8KB: 0x00102000 - 0x00103FFF */
    #define BLOCK_DB2   30	    /*    8KB: 0x00104000 - 0x00105FFF */
    #define BLOCK_DB3   31	    /*    8KB: 0x00106000 - 0x00107FFF */

    /* Array of flash addresses used for writing */
    #if defined(FLASH_BLOCKS_DECLARE)            
    const uint32_t g_flash_BlockAddresses[32] = { 
            /* Caution. ID CODE(FFFFFFA0-FFFFFFAF) is excluded. */ 
			0x00FFE000,  /* EB00 */ 
            0x00FFC000,  /* EB01 */ 
            0x00FFA000,  /* EB02 */ 
            0x00FF8000,  /* EB03 */ 
            0x00FF6000,  /* EB04 */ 
            0x00FF4000,  /* EB05 */ 
            0x00FF2000,  /* EB06 */ 
            0x00FF0000,  /* EB07 */ 
            0x00FE0000,  /* EB08 */ 
            0x00FD0000,  /* EB09 */ 
            0x00FC0000,  /* EB10 */ 
            0x00FB0000,  /* EB11 */ 
            0x00FA0000,  /* EB12 */ 
            0x00F90000,  /* EB13 */ 
            0x00F80000,  /* EB14 */ 
            0x00F70000,  /* EB15 */ 
            0x00F60000,  /* EB16 */ 
            0x00F40000,  /* EB17 */ 
            0x00F20000,  /* EB18 */ 
            0x00F00000,  /* EB19 */ 
            0x00EE0000,  /* EB20 */ 
            0x00EC0000,  /* EB21 */ 
            0x00EA0000,  /* EB22 */ 
            0x00E80000,  /* EB23 */ 
            0x00E60000,  /* EB24 */ 
            0x00E40000,  /* EB25 */ 
            0x00E20000,  /* EB26 */ 
            0x00E00000,  /* EB27 */ 
            0x00100000,  /* DB00 */ 
            0x00102000,  /* DB01 */ 
            0x00104000,  /* DB02 */ 
            0x00106000}; /* DB03 */     
    #else 
    extern const uint32_t g_flash_BlockAddresses[32];
    #endif                                
   
/* Memory specifics for the RX621/N group */
#elif defined(MCU_RX62N) || defined(MCU_RX621)

    /* User ROM Block Area           Size: Start Addr -   End Addr */
    #define BLOCK_0     0		/*    4KB: 0xFFFFF000 - 0xFFFFFFFF */
    #define BLOCK_1     1		/*    4KB: 0xFFFFE000 - 0xFFFFEFFF */
    #define BLOCK_2     2		/*    4KB: 0xFFFFD000 - 0xFFFFDFFF */
    #define BLOCK_3     3		/*    4KB: 0xFFFFC000 - 0xFFFFCFFF */
    #define BLOCK_4     4		/*    4KB: 0xFFFFB000 - 0xFFFFBFFF */
    #define BLOCK_5     5		/*    4KB: 0xFFFFA000 - 0xFFFFAFFF */
    #define BLOCK_6     6		/*    4KB: 0xFFFF9000 - 0xFFFF9FFF */
    #define BLOCK_7     7		/*    4KB: 0xFFFF8000 - 0xFFFF8FFF */
    #define BLOCK_8     8		/*   16KB: 0xFFFF4000 - 0xFFFF7FFF */
    #define BLOCK_9     9		/*   16KB: 0xFFFF0000 - 0xFFFF3FFF */
    #define BLOCK_10    10		/*   16KB: 0xFFFEC000 - 0xFFFEFFFF */
    #define BLOCK_11    11		/*   16KB: 0xFFFE8000 - 0xFFFEBFFF */
    #define BLOCK_12    12		/*   16KB: 0xFFFE4000 - 0xFFFE7FFF */
    #define BLOCK_13    13		/*   16KB: 0xFFFE0000 - 0xFFFE3FFF */
    #define BLOCK_14    14		/*   16KB: 0xFFFDC000 - 0xFFFDFFFF */
    #define BLOCK_15    15		/*   16KB: 0xFFFD8000 - 0xFFFDBFFF */
    #define BLOCK_16    16		/*   16KB: 0xFFFD4000 - 0xFFFD7FFF */
    #define BLOCK_17    17		/*   16KB: 0xFFFD0000 - 0xFFFD3FFF */
    #define BLOCK_18    18		/*   16KB: 0xFFFCC000 - 0xFFFCFFFF */
    #define BLOCK_19    19		/*   16KB: 0xFFFC8000 - 0xFFFCBFFF */
    #define BLOCK_20    20		/*   16KB: 0xFFFC4000 - 0xFFFC7FFF */
    #define BLOCK_21    21		/*   16KB: 0xFFFC0000 - 0xFFFC3FFF */
    #define BLOCK_22    22		/*   16KB: 0xFFFBC000 - 0xFFFBFFFF */
    #define BLOCK_23    23		/*   16KB: 0xFFFB8000 - 0xFFFBBFFF */
    #define BLOCK_24    24		/*   16KB: 0xFFFB4000 - 0xFFFB7FFF */
    #define BLOCK_25    25		/*   16KB: 0xFFFB0000 - 0xFFFB3FFF */
    #define BLOCK_26    26		/*   16KB: 0xFFFAC000 - 0xFFFAFFFF */
    #define BLOCK_27    27		/*   16KB: 0xFFFA8000 - 0xFFFABFFF */
    #define BLOCK_28    28		/*   16KB: 0xFFFA4000 - 0xFFFA7FFF */
    #define BLOCK_29    29		/*   16KB: 0xFFFA0000 - 0xFFFA3FFF */
    #define BLOCK_30    30		/*   16KB: 0xFFF9C000 - 0xFFF9FFFF */
    #define BLOCK_31    31		/*   16KB: 0xFFF98000 - 0xFFF9BFFF */
    #define BLOCK_32    32		/*   16KB: 0xFFF94000 - 0xFFF97FFF */
    #define BLOCK_33    33		/*   16KB: 0xFFF90000 - 0xFFF93FFF */
    #define BLOCK_34    34		/*   16KB: 0xFFF8C000 - 0xFFF8FFFF */
    #define BLOCK_35    35		/*   16KB: 0xFFF88000 - 0xFFF8BFFF */
    #define BLOCK_36    36		/*   16KB: 0xFFF84000 - 0xFFF87FFF */
    #define BLOCK_37    37		/*   16KB: 0xFFF80000 - 0xFFF83FFF */

