pasta-auto/PASTA1.0/ecu-fw/r_Flash_API_RX600.h
    /* Data Flash Block Area         Size: Start Addr -   End Addr */
    #define BLOCK_DB0    70	    /*    2KB: 0x00100000 - 0x001007FF */
    #define BLOCK_DB1    71	    /*    2KB: 0x00100800 - 0x00100FFF */
    #define BLOCK_DB2    72	    /*    2KB: 0x00101000 - 0x001017FF */
    #define BLOCK_DB3    73	    /*    2KB: 0x00101800 - 0x00101FFF */
    #define BLOCK_DB4    74	    /*    2KB: 0x00102000 - 0x001027FF */
    #define BLOCK_DB5    75	    /*    2KB: 0x00102800 - 0x00102FFF */
    #define BLOCK_DB6    76	    /*    2KB: 0x00103000 - 0x001037FF */
    #define BLOCK_DB7    77	    /*    2KB: 0x00103800 - 0x00103FFF */
    #define BLOCK_DB8    78	    /*    2KB: 0x00104000 - 0x001047FF */
    #define BLOCK_DB9    79	    /*    2KB: 0x00104800 - 0x00104FFF */
    #define BLOCK_DB10   80	    /*    2KB: 0x00105000 - 0x001057FF */
    #define BLOCK_DB11   81	    /*    2KB: 0x00105800 - 0x00105FFF */
    #define BLOCK_DB12   82	    /*    2KB: 0x00106000 - 0x001067FF */
    #define BLOCK_DB13   83	    /*    2KB: 0x00106800 - 0x00106FFF */
    #define BLOCK_DB14   84	    /*    2KB: 0x00107000 - 0x001077FF */
    #define BLOCK_DB15   85	    /*    2KB: 0x00107800 - 0x00107FFF */

    /* Array of flash addresses used for writing */
    #if defined(FLASH_BLOCKS_DECLARE)
    const uint32_t g_flash_BlockAddresses[86] = { 
            /* Caution. ID CODE(FFFFFFA0-FFFFFFAF) is excluded. */ 
			0x00FFF000,  /* EB00 */ 
            0x00FFE000,  /* EB01 */ 
            0x00FFD000,  /* EB02 */ 
            0x00FFC000,  /* EB03 */ 
            0x00FFB000,  /* EB04 */ 
            0x00FFA000,  /* EB05 */ 
            0x00FF9000,  /* EB06 */ 
            0x00FF8000,  /* EB07 */ 
            0x00FF4000,  /* EB08 */ 
            0x00FF0000,  /* EB09 */ 
            0x00FEC000,  /* EB10 */ 
            0x00FE8000,  /* EB11 */ 
            0x00FE4000,  /* EB12 */ 
            0x00FE0000,  /* EB13 */ 
            0x00FDC000,  /* EB14 */ 
            0x00FD8000,  /* EB15 */ 
            0x00FD4000,  /* EB16 */ 
            0x00FD0000,  /* EB17 */ 
            0x00FCC000,  /* EB18 */ 
            0x00FC8000,  /* EB19 */ 
            0x00FC4000,  /* EB20 */ 
            0x00FC0000,  /* EB21 */ 
            0x00FBC000,  /* EB22 */ 
            0x00FB8000,  /* EB23 */ 
            0x00FB4000,  /* EB24 */ 
            0x00FB0000,  /* EB25 */ 
            0x00FAC000,  /* EB26 */ 
            0x00FA8000,  /* EB27 */ 
            0x00FA4000,  /* EB28 */ 
            0x00FA0000,  /* EB29 */ 
            0x00F9C000,  /* EB30 */ 
            0x00F98000,  /* EB31 */ 
            0x00F94000,  /* EB32 */ 
            0x00F90000,  /* EB33 */ 
            0x00F8C000,  /* EB34 */ 
            0x00F88000,  /* EB35 */ 
            0x00F84000,  /* EB36 */ 
            0x00F80000,  /* EB37 */ 
            0x00F78000,  /* EB38 */ 
            0x00F70000,  /* EB39 */ 
            0x00F68000,  /* EB40 */ 
            0x00F60000,  /* EB41 */ 
            0x00F58000,  /* EB42 */ 
            0x00F50000,  /* EB43 */ 
            0x00F48000,  /* EB44 */ 
            0x00F40000,  /* EB45 */ 
            0x00F38000,  /* EB46 */ 
            0x00F30000,  /* EB47 */ 
            0x00F28000,  /* EB48 */ 
            0x00F20000,  /* EB49 */ 
            0x00F18000,  /* EB50 */ 
            0x00F10000,  /* EB51 */ 
            0x00F08000,  /* EB52 */ 
            0x00F00000,  /* EB53 */ 
            0x00EF0000,  /* EB54 */ 
            0x00EE0000,  /* EB55 */ 
            0x00ED0000,  /* EB56 */ 
            0x00EC0000,  /* EB57 */ 
            0x00EB0000,  /* EB58 */ 
            0x00EA0000,  /* EB59 */ 
            0x00E90000,  /* EB60 */ 
            0x00E80000,  /* EB61 */ 
            0x00E70000,  /* EB62 */ 
            0x00E60000,  /* EB63 */ 
            0x00E50000,  /* EB64 */ 
            0x00E40000,  /* EB65 */ 
            0x00E30000,  /* EB66 */ 
            0x00E20000,  /* EB67 */ 
            0x00E10000,  /* EB68 */ 
            0x00E00000,  /* EB69 */ 
            0x00100000,  /* DB00 */ 
            0x00100800,  /* DB01 */ 
            0x00101000,  /* DB02 */ 
            0x00101800,  /* DB03 */ 
            0x00102000,  /* DB04 */ 
            0x00102800,  /* DB05 */ 
            0x00103000,  /* DB06 */ 
            0x00103800,  /* DB07 */ 
            0x00104000,  /* DB08 */ 
            0x00104800,  /* DB09 */ 
            0x00105000,  /* DB10 */ 
            0x00105800,  /* DB11 */ 
            0x00106000,  /* DB12 */ 
            0x00106800,  /* DB13 */ 
            0x00107000,  /* DB14 */ 
            0x00107800}; /* DB15 */      

    #else 
    extern const uint32_t g_flash_BlockAddresses[86];
    #endif             
            
#else
    #error "!!! Need to define memory specifics for this RX600 family \
			in r_flash_api_rx600.h !!!"
#endif


#endif /* _FLASH_API_RX600_H */
